Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.monitoring.aws_iam_policy.grafana_cloudwatch: Refreshing state... [id=arn:aws:iam::635140758252:policy/grafana-cloudwatch-policy]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0a47c517f2e872e01]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.monitoring.aws_sns_topic.monitoring_alerts: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:41]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250620024653402000000004]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250620024653386100000002]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250620024653371500000001]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250620024653399300000003]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250620024653647400000006]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250620024653602000000005]
module.monitoring.aws_sns_topic_subscription.email["oosuoos@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:12b939f1-ff9d-422d-a934-d23bc03ac3d5]
module.monitoring.aws_sns_topic_subscription.email["95eksldpf@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:efa89d94-a4b1-4401-a0ce-faa0da5fedd5]
module.monitoring.aws_sns_topic_subscription.email["jintonylove@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:888716c0-8adb-4153-a23d-cb45b9f3c2c3]
module.monitoring.aws_sns_topic_subscription.email["sunyj1225@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:fc8b8dfd-0915-43ea-b921-d3f6700254b4]
module.monitoring.aws_sns_topic_subscription.email["skdurtlxx@gmail.com"]: Refreshing state... [id=arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts:9efb0793-3204-4977-a9fb-8f06b2bdc748]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-09a92f048b2d01486]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-0ab30d598076c9b63]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-06dd253de8b778145]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0160f94db07d4c788]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-0b89a49ecd07049d2]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-023e83e8704c126a1]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-07de98720799abbc2]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-03c9a4a802649489e]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.rds.aws_db_parameter_group.timezone: Refreshing state... [id=news-rds-timezone]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-0026c3b0265ce41d2]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::635140758252:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/85E97C315D44978C1E47E017CE331E21]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.route.aws_route_table.private: Refreshing state... [id=rtb-0f2810554098ae456]
module.route.aws_route_table.public: Refreshing state... [id=rtb-0cdf1871cbcd10c88]
module.monitoring.aws_iam_role.grafana_irsa: Refreshing state... [id=eks-irsa-grafana]
module.monitoring.aws_iam_role_policy_attachment.grafana_attach: Refreshing state... [id=eks-irsa-grafana-2025062002541844590000000b]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-021072a1c940e27b3]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0a1902aa77e54a101]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-0cdf1871cbcd10c881080289494]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0a53b7a13ffb4a0f4]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-099809856670e8226]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-0f2810554098ae4561080289494]
helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.rds.aws_db_instance.this: Refreshing state... [id=db-LUHODFRMUSAKT4HIMGZQU3IFGE]
module.monitoring.aws_cloudwatch_dashboard.main: Refreshing state... [id=main-monitoring]
module.sql_initializer.data.archive_file.lambda_zip: Reading...
module.monitoring.aws_cloudwatch_metric_alarm.rds_cpu_high: Refreshing state... [id=RDS-CPU-High]
module.docker_images.aws_lambda_function.news-crawler_mw: Refreshing state... [id=news-crawler-lambda]
module.sending_news.data.archive_file.lambda_zip: Reading...
module.sql_initializer.data.archive_file.lambda_zip: Read complete after 0s [id=0899ea48a4890ef92bf65a5819e2484b1ea18d7b]
module.sending_news.data.archive_file.lambda_zip: Read complete after 0s [id=06efbeea5b5db0c168e4673cd036e00d561405ac]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["sending_news"]: Refreshing state... [id=sending_news]
module.eventbridge_scheduler.aws_cloudwatch_event_rule.schedule["crawler"]: Refreshing state... [id=crawler]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["sending_news"]: Refreshing state... [id=AllowExecutionFromEventBridge-sending_news]
module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["crawler"]: Refreshing state... [id=AllowExecutionFromEventBridge-crawler]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["sending_news"]: Refreshing state... [id=sending_news-sending-news]
module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda["crawler"]: Refreshing state... [id=crawler-crawler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.monitoring.aws_cloudwatch_log_metric_filter.lambda_mail_fail will be created
  + resource "aws_cloudwatch_log_metric_filter" "lambda_mail_fail" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/news-lambda-handler"
      + name           = "lambda-mail-fail"
      + pattern        = "[메일 전송 실패]"
      + region         = "ap-northeast-2"

      + metric_transformation {
          + name      = "MailSendFail"
          + namespace = "Lambda/Mail"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.monitoring.aws_cloudwatch_log_metric_filter.lambda_mail_success will be created
  + resource "aws_cloudwatch_log_metric_filter" "lambda_mail_success" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/news-lambda-handler"
      + name           = "lambda-mail-success"
      + pattern        = "[메일 전송 성공]"
      + region         = "ap-northeast-2"

      + metric_transformation {
          + name      = "MailSendSuccess"
          + namespace = "Lambda/Mail"
          + unit      = "None"
          + value     = "1"
        }
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.mail_fail_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "mail_fail_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts",
        ]
      + alarm_description                     = "메일 전송 실패 로그가 감지됨"
      + alarm_name                            = "MailSendFailAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MailSendFail"
      + namespace                             = "Lambda/Mail"
      + period                                = 300
      + region                                = "ap-northeast-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.mail_success_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "mail_success_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-2:635140758252:monitoring-alerts",
        ]
      + alarm_description                     = "메일 전송 성공 로그가 감지됨"
      + alarm_name                            = "MailSendSuccessAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MailSendSuccess"
      + namespace                             = "Lambda/Mail"
      + period                                = 300
      + region                                = "ap-northeast-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana-monitoring"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "adminPassword"
              + value = "SuperSecret123"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "service.type"
              + value = "ClusterIP"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.name"
              + value = "grafana"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.create"
              + value = "false"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                # CloudWatch Datasource 정의 추가
                datasources:
                  datasources.yaml:
                    apiVersion: 1
                    datasources:
                      - name: CloudWatch
                        uid: CloudWatch
                        type: cloudwatch
                        access: proxy
                        isDefault: true
                        jsonData:
                          defaultRegion: ap-northeast-2
                      - name: Prometheus
                        uid: prometheus
                        type: prometheus
                        access: proxy
                        url: http://kube-prometheus-stack-prometheus.monitoring.svc.cluster.local:9090
                        isDefault: false
                
                # 대시보드 자동 로드 및 패널 정의
                dashboardProviders:
                  dashboardproviders.yaml:
                    apiVersion: 1
                    providers:
                      - name: "default"
                        orgId: 1
                        folder: ""
                        type: file
                        disableDeletion: false
                        updateIntervalSeconds: 10
                        options:
                          path: /var/lib/grafana/dashboards/default
                
                dashboards:
                  default:
                    news-subscribe-dashboard:
                      json: |
                        {
                          "uid": "news-subscribe-dashboard",
                          "title": "NewsSubscribe Monitoring Dashboard",
                          "time": { "from": "now-6h", "to": "now" },
                          "panels": [
                            {
                              "type": "timeseries",
                              "title": "RDS Replica Lag (s)",
                              "description": "RDS ReplicaLag은 장애 발생 시에만 표시됩니다.",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "ReplicaLag",
                                  "namespace": "AWS/RDS",
                                  "dimensions": { "DBInstanceIdentifier": "news-rds" },
                                  "region": "ap-northeast-2",
                                  "stat": "Maximum",
                                  "period": 60,
                                  "refId": "RDS_ReplicaLag"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "RDS CPUUtilization (%)",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "CPUUtilization",
                                  "namespace": "AWS/RDS",
                                  "dimensions": { "DBInstanceIdentifier": "news-rds" },
                                  "region": "ap-northeast-2",
                                  "stat": "Average",
                                  "period": 60,
                                  "refId": "RDS_CPU"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "RDS DatabaseConnections",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "DatabaseConnections",
                                  "namespace": "AWS/RDS",
                                  "dimensions": { "DBInstanceIdentifier": "news-rds" },
                                  "region": "ap-northeast-2",
                                  "stat": "Average",
                                  "period": 60,
                                  "refId": "RDS_Conn"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "메일 전송 성공",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-lambda-handler} 메일 전송 성공', 'Count', 60)",
                                  "refId": "MailOK_sending",
                                  "region": "ap-northeast-2"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "메일 전송 실패",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-lambda-handler} 메일 전송 실패', 'Count', 60)",
                                  "refId": "MailErr_sending",
                                  "region": "ap-northeast-2"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "Lambda Errors - crawler",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "metricName": "Errors",
                                  "namespace": "AWS/Lambda",
                                  "dimensions": { "FunctionName": "news-crawler-lambda" },
                                  "region": "ap-northeast-2",
                                  "stat": "Sum",
                                  "period": 60,
                                  "refId": "LambdaErr_crawler"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "크롤링 성공",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-crawler-lambda} 크롤링 성공', 'Count', 60)",
                                  "refId": "CrawlOK",
                                  "region": "ap-northeast-2"
                                }
                              ]
                            },
                            {
                              "type": "stat",
                              "title": "크롤링 삭제",
                              "datasource": "CloudWatch",
                              "targets": [
                                {
                                  "expression": "SEARCH('{/aws/lambda/news-crawler-lambda} 크롤링 삭제', 'Count', 60)",
                                  "refId": "CrawlDel",
                                  "region": "ap-northeast-2"
                                }
                              ]
                            }
                          ]
                        }
                    kubelet-dashboard:
                      json: |
                        {"annotations":{"list":[{"builtIn":1,"datasource":{"type":"grafana","uid":"-- Grafana --"},"enable":true,"hide":true,"iconColor":"rgba(0, 211, 255, 1)","name":"Annotations \u0026 Alerts","type":"dashboard"}]},"editable":true,"fiscalYearStartMonth":0,"graphTooltip":0,"id":15,"links":[],"panels":[{"datasource":{"uid":"$datasource"},"fieldConfig":{"defaults":{"links":[],"mappings":[],"thresholds":{"mode":"absolute","steps":[]},"unit":"none"},"overrides":[]},"gridPos":{"h":7,"w":4,"x":0,"y":0},"id":2,"options":{"colorMode":"value","graphMode":"area","justifyMode":"auto","orientation":"auto","reduceOptions":{"calcs":["lastNotNull"],"fields":"","values":false},"showPercentChange":false,"textMode":"auto","wideLayout":true},"pluginVersion":"10.4.0","targets":[{"datasource":{"uid":"$datasource"},"expr":"sum(kubelet_node_name{cluster=\"$cluster\", job=\"kubelet\", metrics_path=\"/metrics\"})","format":"time_series","intervalFactor":2,"legendFormat":"","refId":"A"}],"title":"Running Kubelets","type":"stat"},{"datasource":{"uid":"$datasource"},"fieldConfig":{"defaults":{"links":[],"mappings":[],"thresholds":{"mode":"absolute","steps":[]},"unit":"none"},"overrides":[]},"gridPos":{"h":7,"w":4,"x":4,"y":0},"id":3,"options":{"colorMode":"value","graphMode":"area","justifyMode":"auto","orientation":"auto","reduceOptions":{"calcs":["lastNotNull"],"fields":"","values":false},"showPercentChange":false,"textMode":"auto","wideLayout":true},"pluginVersion":"10.4.0","targets":[{"datasource":{"uid":"$datasource"},"expr":"sum(kubelet_running_pods{cluster=\"$cluster\", job=\"kubelet\", metrics_path=\"/metrics\", instance=~\"$instance\"}) OR sum(kubelet_running_pod_count{cluster=\"$cluster\", job=\"kubelet\", metrics_path=\"/metrics\", instance=~\"$instance\"})","format":"time_series","intervalFactor":2,"legendFormat":"{{instance}}","refId":"A"}],"title":"Running Pods","type":"stat"},{"datasource":{"uid":"$datasource"},"fieldConfig":{"defaults":{"links":[],"mappings":[],"thresholds":{"mode":"absolute","steps":[]},"unit":"none"},"overrides":[]},"gridPos":{"h":7,"w":4,"x":8,"y":0},"id":4,"options":{"colorMode":"value","graphMode":"area","justifyMode":"auto","orientation":"auto","reduceOptions":{"calcs":["lastNotNull"],"fields":"","values":false},"showPercentChange":false,"textMode":"auto","wideLayout":true},"pluginVersion":"10.4.0","targets":[{"datasource":{"uid":"$datasource"},"expr":"sum(kubelet_running_containers{cluster=\"$cluster\", job=\"kubelet\", metrics_path=\"/metrics\", instance=~\"$instance\"}) OR sum(kubelet_running_container_count{cluster=\"$cluster\", job=\"kubelet\", metrics_path=\"/metrics\", instance=~\"$instance\"})","format":"time_series","intervalFactor":2,"legendFormat":"{{instance}}","refId":"A"}],"title":"Running Containers","type":"stat"},{"aliasColors":{},"bars":false,"dashLength":10,"dashes":false,"datasource":{"uid":"$datasource"},"fill":1,"fillGradient":0,"gridPos":{"h":7,"w":12,"x":12,"y":0},"hiddenSeries":false,"id":22,"legend":{"alignAsTable":true,"avg":false,"current":true,"max":false,"min":false,"rightSide":true,"show":true,"total":false,"values":true},"lines":true,"linewidth":1,"nullPointMode":"null","options":{"alertThreshold":true},"percentage":false,"pluginVersion":"10.4.0","pointradius":5,"points":false,"renderer":"flot","seriesOverrides":[],"spaceLength":10,"stack":false,"steppedLine":false,"targets":[{"datasource":{"uid":"$datasource"},"expr":"histogram_quantile(0.99, sum(rate(rest_client_request_duration_seconds_bucket{cluster=\"$cluster\",job=\"kubelet\", metrics_path=\"/metrics\", instance=~\"$instance\"}[$__rate_interval])) by (instance, verb, url, le))","format":"time_series","intervalFactor":2,"legendFormat":"{{instance}} {{verb}} {{url}}","refId":"A"}],"thresholds":[],"timeRegions":[],"title":"Request duration 99th quantile","tooltip":{"shared":true,"sort":0,"value_type":"individual"},"type":"timeseries","xaxis":{"mode":"time","show":true,"values":[]},"yaxes":[{"format":"s","logBase":1,"show":true},{"format":"s","logBase":1,"show":true}],"yaxis":{"align":false}},{"aliasColors":{},"bars":false,"dashLength":10,"dashes":false,"datasource":{"uid":"$datasource"},"fill":1,"fillGradient":0,"gridPos":{"h":7,"w":13,"x":0,"y":7},"hiddenSeries":false,"id":23,"legend":{"alignAsTable":false,"avg":false,"current":false,"max":false,"min":false,"rightSide":false,"show":true,"total":false,"values":false},"lines":true,"linewidth":1,"nullPointMode":"null","options":{"alertThreshold":true},"percentage":false,"pluginVersion":"10.4.0","pointradius":5,"points":false,"renderer":"flot","seriesOverrides":[],"spaceLength":10,"stack":false,"steppedLine":false,"targets":[{"datasource":{"uid":"$datasource"},"expr":"process_resident_memory_bytes{cluster=\"$cluster\",job=\"kubelet\", metrics_path=\"/metrics\",instance=~\"$instance\"}","format":"time_series","intervalFactor":2,"legendFormat":"{{instance}}","refId":"A"}],"thresholds":[],"timeRegions":[],"title":"Memory","tooltip":{"shared":true,"sort":0,"value_type":"individual"},"type":"timeseries","xaxis":{"mode":"time","show":true,"values":[]},"yaxes":[{"format":"bytes","logBase":1,"show":true},{"format":"bytes","logBase":1,"show":true}],"yaxis":{"align":false}},{"aliasColors":{},"bars":false,"dashLength":10,"dashes":false,"datasource":{"uid":"$datasource"},"fill":1,"fillGradient":0,"gridPos":{"h":7,"w":11,"x":13,"y":7},"hiddenSeries":false,"id":24,"legend":{"alignAsTable":false,"avg":false,"current":false,"max":false,"min":false,"rightSide":false,"show":true,"total":false,"values":false},"lines":true,"linewidth":1,"nullPointMode":"null","options":{"alertThreshold":true},"percentage":false,"pluginVersion":"10.4.0","pointradius":5,"points":false,"renderer":"flot","seriesOverrides":[],"spaceLength":10,"stack":false,"steppedLine":false,"targets":[{"datasource":{"uid":"$datasource"},"expr":"rate(process_cpu_seconds_total{cluster=\"$cluster\",job=\"kubelet\", metrics_path=\"/metrics\",instance=~\"$instance\"}[$__rate_interval])","format":"time_series","intervalFactor":2,"legendFormat":"{{instance}}","refId":"A"}],"thresholds":[],"timeRegions":[],"title":"CPU usage","tooltip":{"shared":true,"sort":0,"value_type":"individual"},"type":"timeseries","xaxis":{"mode":"time","show":true,"values":[]},"yaxes":[{"format":"short","logBase":1,"show":true},{"format":"short","logBase":1,"show":true}],"yaxis":{"align":false}}],"refresh":"10s","schemaVersion":39,"tags":["kubernetes-mixin"],"templating":{"list":[{"current":{"selected":false,"text":"default","value":"default"},"hide":0,"includeAll":false,"label":"Data source","multi":false,"name":"datasource","options":[],"query":"prometheus","refresh":1,"regex":"","skipUrlSync":false,"type":"datasource"},{"current":{"isNone":true,"selected":false,"text":"None","value":""},"datasource":{"type":"prometheus","uid":"$datasource"},"definition":"","hide":2,"includeAll":false,"label":"cluster","multi":false,"name":"cluster","options":[],"query":"label_values(up{job=\"kubelet\", metrics_path=\"/metrics\"}, cluster)","refresh":2,"regex":"","skipUrlSync":false,"sort":1,"tagValuesQuery":"","tagsQuery":"","type":"query","useTags":false},{"current":{"selected":false,"text":"All","value":"$__all"},"datasource":{"type":"prometheus","uid":"$datasource"},"definition":"","hide":0,"includeAll":true,"label":"instance","multi":false,"name":"instance","options":[],"query":"label_values(up{job=\"kubelet\", metrics_path=\"/metrics\",cluster=\"$cluster\"}, instance)","refresh":2,"regex":"","skipUrlSync":false,"sort":1,"tagValuesQuery":"","tagsQuery":"","type":"query","useTags":false}]},"time":{"from":"now-1h","to":"now"},"timepicker":{"refresh_intervals":["5s","10s","30s","1m","5m","15m","30m","1h","2h","1d"],"time_options":["5m","15m","1h","6h","12h","24h","2d","7d","30d"]},"timezone":"Asia/Seoul","title":"Kubernetes / Kubelet","uid":"3138fa155d5915769fbded898ac09fd9","version":1,"weekStart":""}
            EOT,
        ]
      + verify                     = false
      + version                    = "7.3.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.monitoring.kubernetes_service_account.grafana will be created
  + resource "kubernetes_service_account" "grafana" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::635140758252:role/eks-irsa-grafana"
            }
          + generation       = (known after apply)
          + name             = "grafana"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

<!-- Sticky Pull Request Comment -->